[{"question_head": ["Bonding", "The Role of Electrons", "Alkanes", "Alkenes", "Alkynes", "Structural Formulas and Isomers", "Functional Groups", "Macromolecules", "Bonding", "The Role of Electrons", "Alkanes", "Alkenes", "Alkynes", "Structural Formulas and Isomers", "Functional Groups", "Macromolecules"], "questions_&_answers": "Bonding1. If a neutral atom gains an electron it becomes a(n)a) covalent bondb) ionic bondc) cationd) anione) valence electron2. The molecule C6H12O6 has what kind of bonding?a) Valence bondingb) Ionic bondingc) Covalent bondingd) Electron bondinge) No bonding3. In an ionic bond, the two atoms have ____________ charges.a) positiveb) negativec) the samed) oppositee) increasing 4. When two non-metals form a chemical bond it is called: a)\tNon-metallic bondb)\tMetallic bondc)\tIonic bondd)\tCovalent bonde)\tHydrogen bond5. Which of the following is true regarding covalent bonds?a) They occur between non-metal atoms.b) They result in atoms sharing electrons.c) They result in atoms completing their valence electron shells.d) All of the abovee) None of the aboveThe Role of Electrons1. Oxygen is a fairly reactive element while Argon is not. This is because:a) Oxygen has a full valence shell of electronsb) Argon has a full valence shell of electronsc) Oxygen is a halogend) Argon is a halogene) Oxygen is a noble gas2. How many lone electron pairs are in the molecule CH3OH? a) 0b) 1c) 2d) 3e) 43. How many lone electron pairs are in the molecule NH3? a) 0b) 1c) 2d) 3e) 44. How many lone electron pairs are in the molecule CO2? a) 0b) 1c) 2d) 3e) 45. How many lone electron pairs are in the molecule C2H4? a) 0b) 1c) 2d) 3e) 46. Why is the H2 molecule more stable than two separate hydrogen atoms? a) The ionic bonding stabilizes the H2 molecule.b) The ionic bonding completes the valence electron shell of the H2 molecule.c) The covalent bonding stabilizes the H2 molecule.d) The covalent bonding completes the valence electron shell of the H2 molecule.e) The H2 molecule is not stable.Alkanes1. What is the name of this alkane?a) 3 ethylpentane b) 2,3 dimethlypentanec) 2 methyl-, 3-ethlyhexaned) 2 methylbutanee) 2 methyl-, 3 ethlypentane2. What is the name of this alkane?a) 3 ethylpentane b) 2,3 dimethlypentanec) 2 methyl-, 3-ethlyhexaned) 2 methylbutanee) 2 methyl-, 3 ethlypentane3. What is the name of this alkane?a) 3 ethylpentane b) 2,3 dimethlypentanec) 2 methyl-, 3-ethlyhexaned) 2 methylbutanee) 2 methyl-, 3 ethlypentane4. What is the name of this alkane?a) 3-ethylpentane b) 2,3 dimethlypentanec) 2 methyl-, 3-ethlyhexaned) 2 methylbutanee) 2 methyl-, 3 ethlypentane5. What is the name of this alkane?a) 3-bromo-, 5 methylhexane \nb) 2,4 dimethlyhexane\nc) 2,4 dibromohexane \nd) 2 methylhexane\ne) 2 methyl-, 4-bromohexane Alkenes1. What is the name of this alkene?a) 1 bromo-, 3 methyl-, 1,4 heptene b) 3 methyl-, 5 bromoheptenec) 2 hexened) 2 methyl-, 2 alkenee) 3 methyl-, 1,4 octene2. What is the name of this alkene?a) 1 bromo-, 3 methyl-, 1,4 heptene b) 3 methyl-, 5 bromoheptenec) 2 hexened) 2 methyl-, 2 alkenee) 3 methy-l, 1,4 octene3. What is the name of this alkene?a) 1 bromo-, 3 methyl-, 1,4 heptene b) 3 methyl-, 5 bromoheptenec) 2 hexened) 2 methyl-, 2 alkenee) 3 methyl-, 1,4 octene4. What is the name of this alkene?a) 1 bromo-, 3 methyl-, 1,4 heptene b) 3 methy-l, 5 bromoheptenec) 2 hexened) 2 methyl-, 2 alkenee) 3,7 dimethyl-, 4 octene5. What is the name of this alkene?a) 1 bromo-, 3 methyl-, heptene \nb) 3 methyl-, 5 bromoheptene\nc) 2 hexene\nd) 2 methyl-, 2 alkene\ne) 3 methyl-, 1,4 octene Alkynes1. What is the name of this alkyne?a) propyneb) 3 methyl-, 2 pentynec) 1 bromo-, 3 methyl-, 4 heptyned) 2 pentynee) 2 methyl-, 2 butyne2. What is the name of this alkyne?a) propyneb) 3 methyl-, 2 pentynec) 1 bromo-, 3 methyl-, 4 heptyned) 2 pentynee) 2 methyl-, 2 butyne3. What is the name of this alkyne?a) propyneb) 3 methyl-, 2 pentynec) 1 bromo-, 3 methyl-, 4 heptyned) 2 pentynee) 2 methyl-, 2 butyne4. What is the name of this alkyne?a) propyneb) 3 methyl-, 2 pentynec) 1 bromo-, 3 methyl-, 4 heptyned) 2 pentynee) 2 methyl-, 2 butyne5. What is the name of this alkyne?a) propyne\nb) 3 methyl-, 2 pentyne\nc) 1 bromo-, 3 methyl-, 4 heptyne\nd) 2 pentyne\ne) 2 methyl-, 2 butyne Structural Formulas and Isomers1. Which of the following is not an isomer of hexane? a) 2-methylpentaneb) 3-methylpentanec) 2,3-dimethylbutaned) 2,2-dimethylbutanee) 1,4-dimethylpentane2. Which of the following is not an isomer of bromopentane? a) 2- bromopentaneb) 3- bromopentanec) 1 bromo-, 3 methylbutaned) 2 bromo-, 3 methylbutanee) 1,4-dimethylpentane3. Which of the following is an isomer of butanol? a) 2-butanolb) 2-methyl-1-proponalc) 2-methyl-1-proponald) All of the abovee) None of the above4. Which of the following is not an isomer of heptane?a) 2-methylhexaneb) 3-methylhexanec) 2,3-methylhexaned) 2,3-dimethylpentanee) 2,4-dimethylpentane 5. Which of the following is not an isomer of octane?a) 3-methylheptaneb) 4-methylheptanec) 3-ethylheptaned) 2,5-dimethylhexanee) 3,4-dimethylhexaneFunctional GroupsMatch the functional group to its structural diagram:    a) Ketone\nb) Aldehyde\nc) Ether\nd) Ester\ne) Carboxylic acid MacromoleculesMatch the macromolecule to its structural diagram:     a) Protein\nb) Sugar\nc) Nucleotide\nd) Saturated fatty acid\ne) Unsaturated fatty acid AnswersBonding1. If a neutral atom gains an electron it becomes a(n)d) anionGaining an electron results in a once neutral atom having a net negative charge. Negatively charged ions are called anions. 2. The molecule C6H12O6 has what kind of bonding?c) Covalent bondingC6H12O6 contains no ions, making it the perfect candidate for covalent bonding. 3. In an ionic bond, the two atoms have ____________ charges.d) oppositeRemember, ionic bonds are like refrigerator magnets: opposite charges attract. 4. When two non-metals form a chemical bond it is called: d) Covalent bondCovalent bonds occur between nonmetals. Ionic bonds occur between a metal and a non-metal. 5. Which of the following is true regarding covalent bonds?a) They occur between non-metal atoms.b) They result in atoms sharing electrons.c) They result in atoms completing their valence electron shells.d) All of the aboveThis question describes the definition of a covalent bond across three answer choices. Covalent bonds occur between non-metal and non-charges atoms, covalent bonds happen when atoms share electrons, and covalent bonds result in molecules filling their valence electron shell. The Role of Electrons1. Oxygen is a fairly reactive element while Argon is not. This is because:b) Argon has a full valence shell of electronsOxygen needs to gain two electrons to become like the nearest noble gas, neon, with a full octet of electrons. Argon has a full outer shell of electrons, so there's no need for it to react with any other atoms. 2. How many lone electron pairs are in the molecule CH3OH? c) 2A Lewis dot diagram shows that there are 2 lone electron pairs (4 electrons total).3. How many lone electron pairs are in the molecule NH3? b) 1A Lewis dot diagram shows that there is 1 lone electron pair (2 electrons total).4. How many lone electron pairs are in the molecule CO2? e) 4A Lewis dot diagram shows that there are 4 lone electron pairs (8 electrons total).5. How many lone electron pairs are in the molecule C2H4? a) 0A Lewis dot diagram shows that there are no lone electron pairs. 6. Why is the H2 molecule more stable than two separate hydrogen atoms? d) The covalent bonding completes the valence electron shell of the H2 molecule.Alkanes1. What is the name of this alkane?d) 2 methylbutaneThe longest carbon chain is 4 carbons, making this a butane. A methyl group is on the second carbon.2. What is the name of this alkane?a) 3 ethylpentane The longest carbon chain is 5 carbons, making this a pentane. An ethyl group is on the third carbon.3. What is the name of this alkane?c) 2 methyl-, 3-ethlyhexaneThe longest carbon chain is 6 carbons, making this a hexane. A methyl group is on the second carbon, and an ethyl group is on the third carbon.4. What is the name of this alkane?b) 2,3 dimethlypentaneThe longest carbon chain is 5 carbons, making this a pentane. A methyl group is on the second carbon and third carbon. 5. What is the name of this alkane?e) 2 methyl-, 4-bromohexaneThe longest carbon chain is 6 carbons, making this a hexane. A methyl group is on the second carbon and a bromide atom is on the fourth carbon. Alkanes are always named with any side groups given the lowest number carbon as possible. Alkenes1. What is the name of this alkene?c) 2 hexeneThe longest carbon chain is 6 carbons, making this a hexene. The double bond comes after the second carbon. 2. What is the name of this alkene?d) 2 methyl-, 2 alkeneThe longest carbon chain is 4 carbons, making this a butene. A methyl group is on the second carbon and the double bond follows the second carbon. 3. What is the name of this alkene?b) 3 methyl-, 5 bromohepteneThe longest carbon chain is 7 carbons, making this a heptene. A methyl group is on the third carbon and a bromide atom is on the fifth carbon. The double bond comes after the first carbon and that makes it understood, so it does not need to be noted. 4. What is the name of this alkene?e) 3,7 dimethyl-, 4 octeneThe longest carbon chain is 8 carbons, making this an octene. A methyl group is on the third and seventh carbon and the double bond comes after carbon four. 5. What is the name of this alkene?a) 1 bromo-, 3 methyl-, heptene The longest carbon chain is 7 carbons, making this a heptene. A methyl group is on the third carbon and a bromide atom is on the first carbon. The double bonds come after carbons one and four. Alkynes1. What is the name of this alkyne?a) propyneThe longest carbon chain is 3 carbons with no additional side chains. 2. What is the name of this alkyne?e) 2 methyl-, 2 butyneThe longest carbon chain is 4 carbons, making this a butyne. A methyl group is on the second carbon and the triple bond comes after carbon two. 3. What is the name of this alkyne?c) 1 bromo-, 3 methyl-, 4 heptyneThe longest carbon chain is 7 carbons, making this a heptyne. A methyl group is on the third carbon, a bromide atom is on the first carbon, and the triple bond comes after carbon four. 4. What is the name of this alkyne?b) 3 methyl-, 2 pentyneThe longest carbon chain is 5 carbons, making this a pentyne. A methyl group is on the third carbon and the triple bond comes after carbon two. 5. What is the name of this alkyne?d) 2 pentyneThe longest carbon chain is 5 carbons, making this a pentyne. The triple bond comes after carbon two. Structural Formulas and Isomers1. Which of the following is not an isomer of hexane? e) 1,4-dimethylpentane1,4 dimethylbutane is an isomer of heptane, one too many carbons to be an isomer of hexane.2. Which of the following is not an isomer of bromopentane? a) 2- bromopentaneb) 3- bromopentanec) 1 bromo-, 3 methylbutaned) 2 bromo-, 3 methylbutanee) 1,4-dimethylpentane1,4 dimethylpentane is an isomer of hexane, too many carbons and no bromide atom to be found. 3. Which of the following is an isomer of butanol? a) 2-butanolb) 2-methyl-1-proponalc) 2-methyl-1-proponald) All of the aboveThe hydroxyl group allows for additional isomers of butanol, because now a methyl group and a hydroxyl group can shift along the main carbon chain. 4. Which of the following is not an isomer of heptane?c) 2,3-methylhexane2,3-methylhexane has 8 carbons, one too many for this party. 5. Which of the following is not an isomer of octane?c) 3-ethylheptane3-ethylheptane has 9 carbons, one too many for this party. Functional GroupsMatch the functional group to its structural diagram:    a) Ketone\nb) Aldehyde\nc) Ether\nd) Ester\ne) Carboxylic acid a) ketone → 2\nb) aldehyde → 1\nc) ether → 4\nd) ester → 5\ne) carboxylic acid → 3 MacromoleculesMatch the macromolecule to its structural diagram:     a) Protein\nb) Sugar\nc) Nucleotide\nd) Saturated fatty acid\ne) Unsaturated fatty acid\na) Protein → 1\nb) Sugar → 5\nc) Nucleotide → 3\nd) Saturated fatty → 4\ne) Unsaturated fatty acid → 2", "imageUrl": ["https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_71.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_72.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_73.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_74.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_75.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_76.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_77.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_78.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_79.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_80.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_81.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_82.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_83.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_84.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_85.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_85.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_86.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_87.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_88.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_89.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_90.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_91.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_92.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_93.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_94.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_67.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_68.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_69.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_70.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_71.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_72.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_73.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_74.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_75.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_76.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_77.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_78.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_79.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_80.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_81.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_82.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_83.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_84.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_85.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_85.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_86.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_87.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_88.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_89.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_90.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_91.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_92.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_93.png", "https://media1.shmoop.com/images/chemistry/chembook_organic_graphik_94.png"], "topic": "organic-chemistry"}]